Revit 2027 API
Application.NewFamilyInstanceCreationData(FamilySymbol, IList<XYZ>) Method
Creates an object which wraps the arguments of NewFamilyInstance() for batch creation.
Namespace: Autodesk.Revit.Creation
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public FamilyInstanceCreationData NewFamilyInstanceCreationData(
	FamilySymbol symbol,
	IList<XYZ> adaptivePoints
)
Public Function NewFamilyInstanceCreationData (
	symbol As FamilySymbol,
	adaptivePoints As IList(Of XYZ)
) As FamilyInstanceCreationData
public:
FamilyInstanceCreationData^ NewFamilyInstanceCreationData(
	FamilySymbol^ symbol,
	IList<XYZ^>^ adaptivePoints
)
member NewFamilyInstanceCreationData :
        symbol : FamilySymbol *
        adaptivePoints : IList<XYZ> -> FamilyInstanceCreationData
Parameters
symbol FamilySymbol
 A FamilySymbol object that represents the type of the instance that is to be inserted.
adaptivePoints IList<XYZ>
 The adaptive point location where the adaptive instance is to be placed.
Return Value
FamilyInstanceCreationData
See Also
Reference
Application Class
NewFamilyInstanceCreationData Overload
Autodesk.Revit.Creation Namespace